{
  "slug": "culture",
  "title": "Culture",
  "tagline": "Stay updated with the latest news, stories, and insights from around the globe.",
  "posts": [
    {
      "slug": "afgan-boy-flies-from-kabul",
      "title": "Afghan boy flies from Kabul to Delhi hiding in plane's landing gear",
      "date": "2025-09-22",
      "category": "Culture",
      "image": "/assets/images/culture/afgan.jpg",
      "content": [
        "A 13-year-old Afghan boy made a dangerous journey from Kabul to Delhi, hiding in the landing gear compartment of a Kam Air passenger plane. Officials say the teen, who is from Kunduz city in northern Afghanistan, was found wandering around on the runway at Delhi's international airport after the plane landed on Monday.",
        "He was detained by Indian security personnel and questioned for several hours before being sent back to Kabul on the same flight.\n\nThe boy reportedly told authorities he made the journey out of curiosity.\n\nA spokesperson from the Indian Central Industrial Security Force (CISF) said the boy managed to travel undetected on Kam Airlines flight RQ-4401, which landed in Delhi around 11:10 (05:40 GMT) on Sunday.\n\nPolice found him roaming around by himself and took him aside for questioning.\n\nThe boy reportedly told authorities that he had hidden himself in the rear central landing gear compartment of the plane.\n\nThe airline staff also found a small red-coloured audio speaker after further safety inspections were carried out.\n\nThe Indian Express newspaper reported that the 13-year-old wanted to travel to Iran and did not know that the flight he entered was bound for Delhi, not Tehran.\n\nAccording to the newspaper, the boy sneaked into Kabul airport, trailed a group of passengers, and stowed away in the aircraft's rear wheel well - the internal compartment which houses the landing gear. He was carrying only the red coloured speaker with him.\n\nThere have been recent incidents of stowaways hiding in flights to the US or Europe, often escaping their home countries. But very few of them make it out alive.\n\nExperts say that many stowaways who survive such flights are often unconscious during descent, putting them at risk of falling to their deaths when the landing gear is lowered.\n\nIn 2022, a 22-year-old Kenyan man was found alive in the wheel well of a cargo plane in Amsterdam."
      ]
    },
    {
      "slug": "why-the-pakistan-saudi",
      "title": "Why the Pakistan-Saudi Arabia defence pact is unsettling India",
      "date": "2025-09-21",
      "category": "Culture",
      "image": "/assets/images/culture/pak.webp",
      "content": [
        "When Shehbaz Sharif, Pakistan's prime minister, clasped Saudi Crown Prince Mohammed bin Salman in Riyadh last week, the symbolism was unmistakable. The embrace followed the signing of a strategic mutual defence agreement, bringing the Islamic world's only nuclear-armed state closer to the Gulf's most ambitious monarchy..",
        "A senior Saudi official told Reuters that the pact was merely an \"institutionalisation of long-standing and deep cooperation\". But many in India see it differently.\n\nDespite Delhi's cultivated warmth with Riyadh, the pact lands amid heightened hostility with Pakistan, including a four-day conflict earlier this year. Nuclear-armed neighbours India and Pakistan have fought multiple wars and clashes over Kashmir, making any move by Saudi to underwrite Pakistan's military a direct concern.\n\nWhat unsettles Indian analysts the most is the pact's commitment that \"any aggression against either country shall be considered an aggression against both\".\n\n\"Riyadh knew India would construe the Saudi-Pakistan pact as a direct threat to its security, yet it went ahead,\" Brahma Chellaney, an Indian strategist, posted on X.\n\n\"The move reflects not Pakistan's strength - it remains on the brink of bankruptcy - but Saudi Arabia's ambitions\", he says. Binding a \"chronically dependent\" partner, he argues, gives Riyadh both manpower and nuclear \"insurance\", while demonstrating to India, Washington and others that it will chart its own path.\n\nFormer Indian foreign secretary Kanwal Sibal called the pact a \"grave misstep\" by Saudi Arabia, warning that this could have serious implications for India's national security.\n\n\"A politically unstable and economically broken Pakistan as a security provider is a dangerous proposition. Saudi Arabia knows this will be construed in India as a threat to India's security,\" Mr Sibal posted on X. \"Given the tensions between Pakistan and India, this Saudi step is strategically most adventurous.\"\n\nIndia's Narendra Modi-led government has been more circumspect, with a foreign ministry spokesman noting that the government will \"study its [the pact's] implications for national security and regional and global stability\". India also hoped that the strategic partnership between India and Saudi Arabia would \"keep in mind mutual interests and sensitivities\"."
      ]
    },
    {
      "slug": "we-tell-it-the-way",
      "title": "'We tell it the way it is': How 'shocking' musical Hair escaped UK censorship",
      "date": "2025-09-22",
      "category": "Culture",
      "image": "/assets/images/culture/uk.webp",
      "content": [
        "The US Love-Rock Musical was infamous for its nude scene, but other aspects of the play were just as radical. In 1968, its director, Tom O'Horgan, told the BBC how it had fallen foul of an outdated UK censorship law that was on the verge of being abolished.",
        "Fifty-seven years ago this week, London's theatregoers were treated to the sight of a stage full of naked actors. That would have been impossible just a day earlier. For more than 200 years, no new play could be put on in Britain unless it was licensed by the Lord Chamberlain, a senior officer of the Royal Household. And nudity was just one thing that this all-powerful censor didn't allow. But the law was changed, and the Lord Chamberlain's dominion finally came to an end on 26 September 1968. The following night, Hair opened at the Shaftesbury Theatre.\n\n\"We couldn't have done the play the way we're doing it prior to this time without drastic modifications,\" the director of the \"American Tribal Love-Rock Musical\", Tom O'Horgan, told the BBC. One of those modifications would have been to cut the famous – or infamous – scene in which the whole cast appears on stage in no costumes except a beaded necklace or two. But O'Horgan didn't believe that the nude scene was \"the major crux of the problem\". In fact, the Lord Chamberlain's office had refused to license Hair in July 1968 for several reasons. \"Much of the publicity has obscured the important aspects of the play,\" said O'Horgan, \"which are also perhaps shocking to people because we deal with the things the way they are, and we tell it the way it is.\""
      ]
    },
    {
      "slug": "why-the-most-controversial-queen",
      "title": "Why 'the most controversial queen in history' was so hated",
      "date": "2025-09-23",
      "category": "Culture",
      "image": "/assets/images/culture/queen.webp",
      "content": [
        "Once the most despised woman in Europe, Marie Antoinette was vilified as an empty-headed libertine, a conspirator and a reckless spendthrift – and then publicly executed. Now a major exhibition interrogates some of the myths that surround her.",
        "All eyes will be on you,\" cautioned Maria Theresa, Empress of Austria, in April 1770, as her daughter, the 14-year-old Archduchess Maria Antonia prepared to marry the future King Louis XVI of France at the Palace of Versailles. Yet the scrutiny endured by Marie Antoinette, as the Archduchess was later known, was far crueller than anticipated. She was vilified as a libertine, a conspirator and a reckless spendthrift, whose exorbitant lifestyle was bankrupting the country – accusations that would precipitate the French Revolution and lead to a rare and shocking spectacle: the public execution of a queen.\n\nOur fascination with Marie Antoinette has never waned, but increasingly her story is being questioned. Did she deserve to be despised, or was she a martyr caught between conflicting interests and destroyed by lies? For Dr Sarah Grant, the curator of Marie Antoinette Style, opening at the V&A on 20 September, she is the \"most fashionable, scrutinised and controversial queen in history\". Marking the 270th anniversary of the birth of this mould-breaking but maligned figure, the show celebrates her sense of style, and interrogates some of the myths associated with her.\n\nOne such myth is her apocryphal \"let them eat cake\" comment, a brattish response to devastating bread shortages. Attributed to \"a great princess\" in Rousseau's Confessions, written in 1765 when Marie Antoinette was aged 10 and still in Austria, it cannot have come from her. More fake news appears in the form of the \"diamond necklace affair\" (1785-6), in which a necklace of more than 600 diamonds was falsely ordered in the queen's name, solidifying her reputation for excess despite her vindication at trial. A replica, along with the Sutherland Necklace, reportedly containing stones from the original, features in the exhibition."
      ]
    },
    {
      "slug": "operation-rockall-successfully-completed",
      "title": "'Operation Rockall successfully completed': The tiny island seized by Britain to foil the USSR",
      "date": "2025-09-15",
      "category": "Culture",
      "image": "/assets/images/culture/island.webp",
      "content": [
        "Seventy years ago, the British Empire claimed its last piece of territory – a bleak and uninhabited island, 260 miles (420km) west of Scotland's Outer Hebrides. In 1955, a Royal Navy commander told the BBC about securing Rockall, which remains the site of rival claims even today.",
        "In 1956, the British naturalist James Fisher described Rockall as the most isolated small rock in the oceans of the world – and understandably so. The island of Rockall is almost unimaginably remote, an 11-hour boat ride from Scotland's Outer Hebrides, and it is also tiny, measuring a mere 82ft (25m) wide, with a summit only 56ft (17m) above sea level. Most of it consists of bare, near-vertical granite, with just one small patch measuring 11ft by 4ft (3.5m by 1.3m) which is level enough to stand on. As insignificant as this jagged stone outcrop might appear, though, Queen Elizabeth II authorised the annexation of Rockall on 14 September 1955, instructing the Royal Navy to take possession of the island on our behalf.Rockall's exact position was first charted by Royal Navy surveyor Captain ATE Vidal in 1831, but it was not until 1949 that Rockall became more widely known, after its name was given to one of the sea areas on BBC Radio's Shipping Forecast. It was around this time that the UK government recognised Rockall's strategic significance. As the Cold War intensified and Nato and Soviet submarines regularly patrolled the North Atlantic, securing Rockall was viewed as key to controlling sea space. Moreover, 230 miles (370km) east, on South Uist in the Outer Hebrides, the UK had established its first test site for US-made guided nuclear missiles. Nato documents, declassified in 1970, revealed the government's fear that hostile agents would install themselves on Rockall to spy on the results of the tests."
      ]
    }
  ]
}
