{
  "slug": "politics",
  "title": "politics",
  "tagline": "Stay updated with the latest news, stories, and insights from around the globe.",
  "posts": [
    {
      "slug": "trump-idea-of-criminal",
      "title": "Trump’s Idea of the Criminal Left Is a Fiction. A Coordinated Defense Against His Fascism Shouldn’t Be.",
      "date": "2025-09-10",
      "category": "politics",
      "image": "/assets/images/politics/trump.webp",
      "content": [
        "The president describes a cartoonish fantasy of a George Soros-backed criminal network. If only the left were that good at collective defense.",

        "Multibillionaire investor George Soros is not funding a network of militant left-wing activists. That fact has not stopped President Donald Trump from spending the days since Charlie Kirk’s killing calling to press charges against the liberal philanthropist under the Racketeer Influenced and Corrupt Organizations, or RICO, Act for allegedly bankrolling “violent” leftist protests across the country. This absurd idea is among an array of repressive proposals, ranging from the illegal to the unconstitutional, that Trump and his acolytes have pulled from a cartoonishly blatant playbook of fascist scapegoating — conspiracies of Jewish dark money and all. The Trump administration will likely fail to bring successful prosecutions against the disparate liberal and leftist individuals and organizations they see as a well-funded criminal network. But we are long past the point of pretending the administration will be bound by law, or tethered to factual reality, when it comes to achieving its broader authoritarian goals.\n\nMost Read\n\nUnnamed Pentagon Officials Ridicule Hegseth’s Plan to Stop War Department Leaks\nNick Turse\nThe day after StopICE.net put this post on Instagram, the Department of Homeland Security sent an administrative subpoena to Meta for information about StopICE.net’s account and others.\n\nThe Feds Want to Unmask Instagram Accounts That Identified Immigration Agents\nShawn Musgrave\nBrendan Carr, commissioner at the Federal Communications Commission (FCC), speaks during a House Appropriations Subcommittee on Financial Services and General Government hearing in Washington, DC, US, on Wednesday, May 21, 2025. The Trump administration is focused on freeing up more electromagnetic spectrum to power wireless communication, the chairman of the Federal Communications Commission said earlier this month, a move that could generate $80 billion in government revenue and help the US better compete with China. Photographer: Alex Wroblewski/Bloomberg via Getty Images\n\nWhy FCC Chief Brendan Carr May Be the Most Dangerous Man in Media\nJonathan Reiss\n\nTrump announced on Wednesday night, for example, that he was designating antifa a “major terrorist organization.” The proclamation, posted on Truth Social, is senseless in a number of ways."
      ]
    },
    {
      "slug": "trump-wants-label-antifa",
      "title": "Trump Wants to Label Antifa a Terror Group. His Real Target Might Be a Lot Bigger.",
      "date": "2025-09-18",
      "category": "politics",
      "image": "/assets/images/politics/t-wants.webp",
      "content": [
        "The domestic terror designation might be a flop, but Trump will keep trying to find ways to crush the left.",
        "Donald Trump’s obsession with antifa surfaced again Wednesday as the president announced that he was designating the loose-knit anti-fascist political movement as a “major terror organization.” That phrase does not appear in U.S. law or federal regulations, but legal niceties did not stop Trump from making a nearly identical announcement during the Black Lives Matter protests in 2020. While there’s no legal mechanism allowing the Trump administration to directly label a domestic terror group, experts warn that the Trump administration could still try to find creative ways to put American activists in court or under financial pressure by tying them to foreign groups. As Trump and allies try to use last week’s assassination of Charlie Kirk to paint left-wing groups with no ties to the alleged killer as threats to the country, the larger danger may stem from the very looseness of the term antifa, warned Mark Bray, a historian and author of “Antifa: The Anti-Fascist Handbook.” “There is a kind of paradox. Because on the one hand, it is so vague that how could they make a law designating antifa as a terrorist organization? It’s a broad politics, it’s not a specific organization,” Bray said. “On the other hand, the broadness and the lack of a concrete, overarching organization could allow the Trump administration or judges or prosecutors to label as antifa anyone on the left, particularly the radical left.” The White House did not respond to a request for comment Thursday."
      ]
    },
    {
      "slug": "trump-sanctions-palestinian",
      "title": "Trump Sanctions Palestinian Human Rights Groups for Doing Their Job. Anybody Could Be Next.",
      "date": "2025-09-16",
      "category": "politics",
      "image": "/assets/images/politics/palest.webp",
      "content": [
        "It’s the first time the U.S. has sanctioned an organization specifically for using lawful, peaceful tools of advocacy.",
        "Trump Sanctions Palestinian Human Rights Groups for Doing Their Job. Anybody Could Be Next. It’s the first time the U.S. has sanctioned an organization specifically for using lawful, peaceful tools of advocacy. For decades, the Treasury Department has politicized its authority to impose sanctions. Now, however, with the Trump administration sanctioning three Palestinian human rights organizations, civil society activists around the world are shocked and terrified: Could they be next? The alarm is due to the brazen willingness of President Donald Trump to sanction the staff of these Palestinian groups specifically because of their advocacy with the International Criminal Court to hold Israeli war criminals accountable. It’s the first time the U.S. has levied sanctions against an organization specifically for its efforts to use lawful, peaceful tools of advocacy in pursuit of legal accountability. There is no pretense other than the groups’ work on legal issues that the administration doesn’t like."
      ]
    },
    {
      "slug": "the-house-just-passed-bill",
      "title": "The House Just Passed a Bill Punishing “Politically Motivated” Boycotts of Israel",
      "date": "2025-09-11",
      "category": "politics",
      "image": "/assets/images/politics/house.webp",
      "content": [
        "IFar-right Rep. Lauren Boebert added an amendment to the Pentagon budget that targets the BDS movement against Israel.",
        "In a first step toward a federal law punishing criticism of Israel, the House of Representatives on Wednesday passed a massive defense budget that would bar companies engaged in “politically motivated” boycotts of the country from Pentagon contracts. The bill would effectively ban contractors boycotting Israel from tapping most federal contract dollars, since more than half of the $755 billion the U.S. government spent on contracts last year flowed through the Defense Department. “This amendment is really designed to shield Israel from any accountability.” The ban, the latest legislative attempt to target the Boycott, Divestment, and Sanctions movement against Israel’s human rights violations, or BDS, would still have to pass the Senate. The upper chamber was debating its own version of the budget bill on Thursday that does not include an anti-BDS provision. Critics predict a court challenge if the anti-boycott provision makes it into law. “This amendment is really designed to shield Israel from any accountability by penalizing those who protest its violations of Palestinian human rights through boycotts, which should be protected by the First Amendment,” said Hassan El-Tayyab, the legislative director for Middle East policy at the Friends Committee on National Legislation. The anti-BDS provision was spearheaded by Rep. Lauren Boebert, R-Colo., whose office did not respond to a request for comment. Boebert’s measure received no discussion when it was approved by the House on a voice vote as part of a package of amendments to the budget bill Tuesday. The House went on to pass the full, amended version of the National Defense Authorization Act on Wednesday night."
      ]
    },
    {
      "slug": "trump-escalates-assault",
      "title": "Trump Escalates Assault on Chicago With “Operation Midway Blitz”",
      "date": "2025-01-25",
      "category": "politics",
      "image": "/assets/images/politics/ass.webp",
      "content": [
        "DHS announced a new ICE operation targeting Chicago on Monday, days after President Trump likened his assault on the city to the Vietnam War.",
        "The Trump administration said on Monday that it was launching an operation targeting “criminal illegal aliens” in Chicago, dubbed Operation Midway Blitz. The announcement came two days after President Donald Trump posted an AI-generated image on Truth Social depicting himself as Lt. Col. Bill Kilgore from Francis Ford Coppola’s 1979 Vietnam War epic Apocalypse Now. In the film, Kilgore – an Air Cavalry Regiment commander who refers to Vietnamese people with a number of vile slurs – annihilates a village to secure a beach for surfing. Trump’s AI image was captioned with a riff on the character’s most famous line: “‘I love the smell of deportations in the morning…’” “Chicago about to find out why it’s called the Department of WAR,” the president’s post continued. It came a day after Trump signed an executive order changing the Defense Department’s name to the Department of War. Following backlash to his threat to make war on America’s third largest city, Trump assured Chicagoans that “Only the Criminals will be hurt!” in another post. That has not reassured Chicago’s elected officials. “Trump swore an oath to protect the American people and defend the Constitution. Instead, he is declaring war on every American – including Chicagoans – who stands against his fascist agenda,” Congressmember Delia Ramirez, D-Ill, told The Intercept. “Attacking American cities and wasting billions of dollars on unlawful activities, while cutting essential services for working families are the tactics of wannabe dictators. Trump has betrayed his Constitutional duties and should be impeached.”"
      ]
    }
  ]
}
