{
  "slug": "sports",
  "title": "Sports",
  "tagline": "Stay updated with the latest news, stories, and insights from around the globe.",
  "posts": [
    {
      "slug": "soccers-most-expensive",
      "title": "Soccer's Most Expensive Transfers: Isak Joins Neymar, Mbappé in Top 5",
      "date": "2025-09-01",
      "category": "Sports",
      "image": "/assets/images/sports/neymar.webp",
      "content": [
        "It's been all about splashing the cash for Liverpool.The defending English Premier League champions spent an incredible $570 million in transfer fees this summer, headlined by two blockbuster deals in German playmaker Florian Wirtz and Swedish striker Alexander Isak. ",
        "The duo is expected to continue bringing some serious silverware to Anfield, including yet another Champions League title. So, where do these deals rank among the most expensive in soccer history? Here's a look at the top 10 and how they played out:\n\n1. Neymar: $239 million (Barcelona to PSG, 2017)\n\nIt was always going to be difficult for Neymar to live up to the $239 million price tag that PSG paid Barcelona for his talents in 2017, but injuries made it even harder for him to justify it. He wasn't able to bring PSG its Champions League victory. Still, he had an outstanding career with the club, recording 118 goals and 77 assists in 173 appearances, and winning 13 trophies in six years. A disappointing spell at Saudi side Al-Hilal prompted a return to his boyhood club Santos in Brazil earlier this year in hopes of staying in the mix for the 2026 FIFA World Cup."
      ]
    },
    {
      "slug": "england-gather-bowling-attack",
      "title": "England gather their most hostile Ashes bowling attack since 1970",
      "date": "2025-09-23",
      "category": "Sports",
      "image": "/assets/images/sports/england.webp",
      "content": [
        "Mark Wood, left, Jofra Archer, centre, and Gus Atkinson are all capable of bowling at high speed and generating steep bounce",
        "So far, so good.\n\nIf at any point in the past year England had been offered the Ashes squad they were able to name on Tuesday, they would have played an extra 18 holes to celebrate.\n\nMoves to assemble this group of players started in the summer of 2024. This will be England's first James Andersonless Ashes tour in more than 20 years. No matter how great a bowler he has been, the absence of an Anderson-style bowler is a sign England's plan has come together.\n\nToo often England have arrived at an Australian gunfight armed only with knives.\n\nNow, Mark Wood, Jofra Archer, Josh Tongue, Gus Atkinson, Brydon Carse, Matthew Potts and Ben Stokes can fight fire with fire. It is probably the most hostile group of fast bowlers England have sent down under since John Snow and Bob Willis were at the forefront of victory in 1970-71, the last time England beat a strong Australia team in Australia.\n\nThe first Test on a spicy Perth pitch, then the pink-ball Test in Brisbane will not be for the faint-hearted. England might not opt for a spinner in either and will hope to unleash Wood and Archer together in Perth at least.\n\nThey will be box-office slugfests. Somehow, the tourists need to buck their trend of starting Ashes tours awfully and get out of the opening two on level terms at worst. There would be no coming back from 2-0 down.\n\nEngland say Stokes will recover from his shoulder injury by 21 November, but there will be huge concern over the talismanic skipper's ability to get through the whole series – he has not played a full part in any of England's past four.\n\nWithout Stokes, chances of returning with the urn dwindle to almost nothing. Protecting the captain could be another reason to play four frontline seamers in Perth.\n\nThe case of Wood is a curious one. The fastest bowler in the world has not played a Test since last August because of elbow and knee injuries. A comeback has been gradually pushed back to the point where he has not played at all this summer. Wood states he is best when fresh and there is a body of evidence to support his theory. He will certainly be fresh in Perth.\n\nStokes and Wood are the only two bowlers in the squad that have played a Test in Australia – overall only five players survive from the previous tour four years ago, a churn that is to be expected when England's record down under is so wretched.\n\nThere are arguably questions about the durability of the entire attack, as all of Archer, Atkinson, Carse and Tongue have had injury problems in the recent past. It was ever thus. Fast bowling is hard work. Archer, the trump card, has shown a recent robustness. It is a collective England could only have imagined in their wildest dreams.\n\nWill Jacks' inclusion as the cover for Shoaib Bashir perhaps reveals the part, or lack of it, spin will play in the series.\n\nJacks is a batting all-rounder who played two Tests three years ago and has taken only five first-class wickets this year. In being a tall off-spinner, he mimics the qualities of Bashir and the multi-dimensional aspects of his game give England options."
      ]
    },
    {
      "slug": "why-bonmati-special",
      "title": "Why are Barcelona's Ballon d'Or winners Bonmati and Lopez so special?",
      "date": "2025-09-22",
      "category": "Sports",
      "image": "/assets/images/sports/berca.jpg",
      "content": [
        "The Ballon d'Or is one of the most prestigious individual awards in football, given to the best men's and women's player of the last year. And for 2025, Barcelona's women had a great day at the Théâtre du Châtelet, winning the Ballon d'Or, the inaugural Kopa Trophy for Best under-21 player, and Gerd Muller prize for top goal scorer.",
        "Bonmati made history by becoming the first women's player to win the Ballon d'Or three times, overtaking her midfield partner for club and country, Alexia Putellas. The 27-year-old didn't take home the UEFA Women's Champions League trophy, after a 1-0 defeat to Arsenal, but she did win a domestic treble with Barcelona and played a crucial role in all competitions. She also helped catapult Spain into their first-ever Women's Euros final, though that also ended in a 1-0 defeat to England.\n\nStanding only 5-foot-4, she is a savant on the ball, blessed with excellent first touch and close control. Bonmati's influence was evident in every phase of play for both club and country, and she finished joint fifth for most goal contributions in Liga F, with 12 goals and six assists -- her third consecutive season with 15+ -- while, in the UWCL, only teammate Patri Guijarro (5) had more assists than her four.\n\nThe midfield maestro is heavily influential in Barcelona's attacks, consistently creating chances and getting into the box. Her vision, skill on the ball and inventiveness is what separates Bonmati from the rest, as her ability to receive possession on the half-turn then move forward allows her to dissect the defense and create opportunities for her teammates.\n\nNo player created more chances (68) than Bonmati in Liga F and the UWCL (31) in 2024-25, while her 162 touches inside the penalty box was the fourth-most by any player in the Liga F and the most by any midfielder. She also attempted the fourth-most take-ons (37) in the UWCL, the most by any midfielder in the competition.\n\nHer on-the-ball qualities are undeniable, but it's Bonmati's tenacity off the ball that makes her indispensable and she ranked fifth for most ball recoveries (63) in the UWCL as a vital part of her team's counter-pressing scheme.\n\nBeyond the stats, Bonmati was also a clutch performer in crucial stages of games for her teams. Her goal in added time against Germany in the Euro 2025 semifinals put Spain into their first final, while she also had a goal contribution in all but one of Barcelona's knockout games in the UWCL last season."
      ]
    },
    {
      "slug": "why-nfl-dublin-opens",
      "title": "Why NFL Dublin opens 'new chapter' for Irish sport",
      "date": "2025-09-23",
      "category": "Sports",
      "image": "/assets/images/sports/1.jpg",
      "content": [
        "NFL broadcaster Michael McQuaid was in New Orleans for last season's Super Bowl when the Dublin announcement was made. By then, the Irish Steelers Podcast host knew the NFL would be making a long-awaited return to Ireland, but nothing had prepared him for that moment in February",
        "The manner in which it was announced, at the Super Bowl, when it's already fever pitch that week... to see the reaction back home and in the US, it was really special,\" he told BBC Sport.\n\n\"Honestly, it really hit home in that moment that so many people on the island of Ireland really achieved what so many have wanted for such a long time.\"\n\nOn Sunday Dublin will become the fourth European city to host a regular-season game as the Pittsburgh Steelers play the Minnesota Vikings at Croke Park.\n\n\"This puts Dublin among some of the world's largest and most well-known cities,\" McQuaid said. \"It's a new chapter for what is already a sporting island.\""
      ]
    },
    {
      "slug": "abhishek-smashes-74-off-39",
      "title": "Abhishek smashes 74 off 39 as India ease past Pakistan",
      "date": "2025-09-23",
      "category": "Sports",
      "image": "/assets/images/sports/abhi.jpg",
      "content": [
        "Suryakumar Yadav is thrilled with the way his team is stepping up, making his job easy. He says the team was calm after the first 10 overs [when Pakistan scored 91] and told the team during drinks, the game starts now. Shivam Dube is not a robot, he will have a bad day someday, but the way he comes back, really happy. ",
        "10.40pm Abhishek Sharma is the Player of the Match for his 74 off 39 with six fours and five sixes. He says about his high strike rate, today it was very simple, the way they were coming at us for no reason, I didn't like it at all and this is the only way I could give medicine to them. He says he has been playing with Shubman since his school days and he was waiting for a partnership like this with him for a long while. He feels its important for the team that he plays the way he plays and he's able to play in such an aggressive manner because the team has been supporting him to play that way knowing it is high risk and may not always come off.Lots of love between the Indians in the dugout. No handshakes with Pakistan though. This has been clinical, from the way their bowlers pulled things back in the last 10 overs, with Shivam Dube putting in a big shift, to their openers coming at the target with no holds barred, this has been a thoroughly class performance. Abhishek Sharma and Shubman Gill put India so far ahead with their opening stand - 105 in 59 balls chasing 171 - that the little hiccup later in the innings - where it looked like Samson in the middle order experiment wasn't exactly working - didn't matter in the end."
      ]
    }
  ]
}
