{
  "slug": "world-news",
  "title": "World News",
  "tagline": "James Carter and Emily Brooks on the future of the MAGA movement",
  "posts": [
    {
      "slug": "maga-movement",
      "title": "James Carter and Emily Brooks on the future of the MAGA movement",
      "date": "2025-09-22",
      "category": "World News",
      "image": "/assets/images/podcasts/3.webp",
      "content": [
        "NPR’s James Carter and Emily Brooks of the Cook Political Report with Emily Brooks join Geoff Bennett to discuss the latest political news, including the pace of actions coming from President Trump eight months into his term and the future of his MAGA movement.",
        "It has been eight months since President Trump returned to the White House, and the pace of actions coming from his administration continues to accelerate. To help sort through a busy few days, we are joined now by our Politics Monday duo. That's Amy Walter of The Cook Political Report With Amy Walter and Tamara Keith of NPR. It's always great to see you both. And, look, if folks are overwhelmed by the news and recent developments out of Washington, they have good reason to be. Our team put together a list of just what has transpired since this past weekend. You see it all there. Tam — and this, we should say, is not the entirety of it. But let's talk about the president being unusually explicit in directing his attorney general to pursue criminal cases against his political opponents, something that past presidents even avoided hinting at. How should we understand the way President Trump is wielding power right now?"
      ]
    },
    {
      "slug": "seasonal-crop-outlook-support",
      "title": "Seasonal Crop Outlook & Support Programs Summary",
      "date": "2025-09-26",
      "category": "World News",
      "image": "https://placehold.co/1200x630/ffffff/111111?text=Seasonal+Crop+Outlook",
      "content": [
        "An international agriculture bulletin provided a neutral overview of seasonal crop conditions and support programs. The brief compiles publicly available observations on rainfall, soil moisture, and planting progress, noting that most regions remain within typical ranges for this time of year. Extension services continue to offer training on irrigation efficiency, soil testing, and post‑harvest storage to reduce loss and improve incomes for small producers.",
        "Financial cooperatives and local banks are coordinating with authorities to share information about standard credit products and risk‑management tools. A separate annex lists helplines and mobile advisory units visiting rural districts during the planting window. The bulletin emphasizes crop rotation planning, record‑keeping templates for input costs, and safety reminders for operating machinery at night during peak workloads. Upcoming editions will include comparative charts based on farmer‑submitted yield data to help communities benchmark performance."
      ]
    },
    {
      "slug": "university-research-office-posts-annual",
      "title": "University Research Office Posts Annual Grants & Disclosure Update",
      "date": "2025-09-25",
      "category": "World News",
      "image": "https://placehold.co/1200x630/ffffff/111111?text=University+Research+Update",
      "content": [
        "A university research office published its annual grants and disclosure dashboard. The update rolls up externally funded projects, internal seed grants, and open datasets created over the past year, with filters for department and topic area. Guidance documents remind principal investigators about conflict‑of‑interest disclosures, open‑access archiving, and research data management plans.",
        "The dashboard also consolidates training resources on ethics approvals, export controls, and publication licensing. Students and staff can subscribe to a quarterly newsletter highlighting funding calls, collaborative opportunities, and toolkits for reproducible workflows. According to the office, the release is part of a regular transparency effort to make research activities easier to find and understand for the campus community and the public."
      ]
    },
    {
      "slug": "data-shows-political-violence",
      "title": "Community Safety Indicators: Quarterly Snapshot",
      "date": "2025-09-24",
      "category": "World News",
      "image": "https://placehold.co/1200x630/ffffff/111111?text=Community+Safety+Snapshot",
      "content": [
        "Public safety agencies released a routine quarterly snapshot of community safety indicators. The report tracks emergency response times, preparedness drills, and community outreach events hosted during the past quarter, with comparisons to the same period last year. Officials note that metrics remain broadly stable and encourage residents to enroll in local alert systems for weather, health, and infrastructure notices.",
        "The snapshot includes tips on assembling a basic household readiness kit, registering vulnerable family members for wellness checks, and using non‑emergency lines to reduce call congestion. A section on data methods explains how indicators are calculated and how privacy is protected when publishing aggregate statistics. Agencies plan to hold virtual Q&A sessions to help residents interpret the figures and suggest additional indicators for future editions."
      ]
    }
  ]
}
